<a href="https://colab.research.google.com/github/Neel12-coder/Python-Datascience/blob/main/Pandas_Data_Input_Output.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
pwd #gives path

'/content'

In [5]:
#df = pd.read_csv("") to read csv file

In [6]:
#df.to_csv("myout",index=False) # first arg is name that u wish to give to ur csv file and index is true bydef make it fal to use old index

In [7]:
# pd.read_excel("abc.xlsx",sheet_name="Sheet1")

In [8]:
# df.to_excel("op.xlsx",sheet_name ="Sheet1")

In [10]:
data = pd.read_html("https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/")
data

[                         Bank NameBank  ... FundFund
 0                    Almena State Bank  ...    10538
 1           First City Bank of Florida  ...    10537
 2                 The First State Bank  ...    10536
 3                   Ericson State Bank  ...    10535
 4     City National Bank of New Jersey  ...    10534
 ..                                 ...  ...      ...
 558                 Superior Bank, FSB  ...     6004
 559                Malta National Bank  ...     4648
 560    First Alliance Bank & Trust Co.  ...     4647
 561  National State Bank of Metropolis  ...     4646
 562                   Bank of Honolulu  ...     4645

 [563 rows x 7 columns]]

In [11]:
data[0]

                         Bank NameBank  ... FundFund
0                    Almena State Bank  ...    10538
1           First City Bank of Florida  ...    10537
2                 The First State Bank  ...    10536
3                   Ericson State Bank  ...    10535
4     City National Bank of New Jersey  ...    10534
..                                 ...  ...      ...
558                 Superior Bank, FSB  ...     6004
559                Malta National Bank  ...     4648
560    First Alliance Bank & Trust Co.  ...     4647
561  National State Bank of Metropolis  ...     4646
562                   Bank of Honolulu  ...     4645

[563 rows x 7 columns]